test/integration/data.pyvmomi.clone/request-94.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <PowerOnVM_Task xmlns="urn:vim25">
      <_this type="VirtualMachine">vm-68</_this>
    </PowerOnVM_Task>
  </soapenv:Body>
</soapenv:Envelope>
